In [1]:
import pandas as pd

#### concat(axis, join, ignore_index,)
* join- inner/outer................default: Outer

In [27]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df1

   A  B
0  1  3
1  2  4

In [28]:
df2 = pd.DataFrame({'A': [1, 6], 'B': [3, 8]})
df2

   A  B
0  1  3
1  6  8

In [13]:
df3 = pd.DataFrame({'A': [5, 6,9], 'B': [7, 8,10], 'C': [5,6,7]})

In [17]:
pd.concat([df1, df2, df3], ignore_index=True)

   A   B    C
0  1   3  NaN
1  2   4  NaN
2  5   7  NaN
3  6   8  NaN
4  5   7  5.0
5  6   8  6.0
6  9  10  7.0

In [24]:
pd.concat([df1,df2, df3], axis=1)

     A    B    A    B  A   B  C
0  1.0  3.0  1.0  3.0  5   7  5
1  2.0  4.0  6.0  8.0  6   8  6
2  NaN  NaN  NaN  NaN  9  10  7

In [34]:
pd.concat([df1,df3], join='inner')               # join= inner ; keep only common columns;

   A   B
0  1   3
1  2   4
0  5   7
1  6   8
2  9  10